// დაწერეთ პროგრამა რომელიც კონსოლში გამოიტანს "Hello World" -ს.
console.log("hello world");

// შექმენით ცვლადი და მიანიჭეთ მას რიცხვი. დაბეჭდეთ ცვლადის მნიშვნელობა.
let num = 10;
console.log(num);

// დაწერეთ პროგრამა ორი რიცხვის შესაკრებად და შედეგის გამოსატანად.
console.log(10 + 5);

// დაწერეთ პროგრამა რომელიც გამოაკლებს ორ რიცხვს ერთმანეთს და აჩვენებს შედეგს
console.log(10 - 5);

// დაწერეთ პროგრამა ორი რიცხვის გასამრავლებლად და შედეგის გამოსატანად.
console.log(27 * 89);

// დაწერეთ პროგრამა ორი რიცხვის გასაყოფად და შედეგის გამოსატანად.
console.log(9 / 3);

// დაწერეთ პროგრამა ორი რიცხვის გაყოფის ნაშთის გამოსათვლელად.
console.log(10 % 3);

// შექმენით ცვლადი და მიანიჭეთ მას სტრიქონი. ამობეჭდეთ სტრიქონის სიგრძე.
let word = "AlgoUni";
console.log(word.length);

// დაწერეთ პროგრამა ორი სტრიქონის შესაერთებლად და შედეგის ჩვენების მიზნით.
let wordOne = "star"
let wordTwo = "light"
console.log(wordOne + wordTwo)

// დაწერეთ პროგრამა სტრიქონის დიდ ასოებზე გადასაყვანად.
let name = "gvanca"
console.log(name.toUpperCase())

// დაწერეთ პროგრამა სტრიქონის მცირე ასოზე გადასაყვანად.
name = "GVANCA"
console.log(name.toLowerCase())
